Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: It uses a "sprite strip", where each sub-image is be an individual symbol or letter, and the images are mapped to letters based on the argument "string_map" of the function.
zh_cn: 它使用一个"精灵条"，其中每个子图像是一个单独的符号或字母，根据函数的参数"string_map"将图像映射到字母。

source: It uses the indicated step size while trying to avoid collision with either all instances or only those flagged as solid.
zh_cn: 它使用指示的步长，同时试图避免与所有实例或仅标记为实体的实例发生碰撞。

source: It uses the indicated step size while trying to avoid collision with instances of the object specified by the "obj" argument.
zh_cn: 它使用指示的步长，同时试图避免与由"obj"参数指定的对象的实例碰撞。

source: It uses the indicated step size, the same as in the function mp_linear_step().
zh_cn: 它使用指定的步长，与函数mp_linear_step()中的步长相同。

source: It will be snapped to the nearest corresponding position on the "invisible" grid that the hsnap and vsnap values define.
zh_cn: 它将被捕捉到由hsnap和vsnap值定义的"不可见"网格上最近的相应位置。

source: It will check to see if the user is already logged into Google services, in which case it will return true, or not, returning false.
zh_cn: 它将检查用户是否已经登录到谷歌服务，在这种情况下，它将返回true，或不返回false。

source: It will not dequeue the value, meaning that it can still be read in the future by this function or the ds_queue_dequeue().
zh_cn: 它不会将该值出队，这意味着它仍然可以在将来被此函数或ds_queue_dequeue()读取。

source: It will not pop the value, meaning that it can still be read in the future by this function or the ds_stack_pop().
zh_cn: 它不会弹出该值，这意味着它仍然可以在将来被此函数或ds_stack_pop()读取。

source: It will only work for those games running through a browser (ie: HTML5), and for all other platforms it will return true.
zh_cn: 它只适用于那些通过浏览器运行的游戏(即HTML5)，对于所有其他平台，它将返回true。

source: It will return a new buffer's ID which is created by the function as a "grow" buffer (see here) with a byte alignment of 1.
zh_cn: 它将返回一个新的缓冲区ID，该ID由函数创建为一个字节对齐为1的"增长"缓冲区(参见此处)。

source: It will return only the decimals behind the dot of a value, so frac(3.125) will return 0.125, frac(6.921) will return 0.921, etc...
zh_cn: 它将只返回一个值的点后面的小数，所以frac(3.125)将返回0.125,frac(6.921)将返回0.921，等等……

source: It will then use the 0,0 defining point of the physics world to calculate the direction and strength of gravity based on the vector calculated from the xg and yg inputs.
zh_cn: 然后，它将使用物理世界的0，0定义点，根据从xg和yg输入计算的向量来计算重力的方向和强度。

source: It will trigger a callback Social Asynchronous Event which contains the async_load map populated with the relevant key/value pairs.
zh_cn: 它将触发一个回调社交异步事件，其中包含用相关键/值对填充的async_load映射。

source: It works in exactly the same way as point_distance() but with the addition of factoring in the z value (depth) for use in 3D space.
zh_cn: 它的工作方式与point_distance()完全相同，但添加了在3D空间中使用的z值(深度)。

source: It works simply by subtracting an amount from the speed every step until the object has a speed of 0, so if the friction is set to, for example, 0.1 and the speed of the instance is 1 (1 pixel per step), it will slow down and stop after 10 steps have passed.
zh_cn: 它的工作原理很简单，就是每一步从速度中减去一个量，直到物体的速度为0，所以如果将摩擦设置为0.1，实例的速度为1(每一步1像素)，它将在经过10步后减速并停止。

source: It's important to note that when you switch off automatic drawing and draw the application surface yourself, that you may see certain issues with the alpha component of sprites and the surface itself.
zh_cn: 需要注意的是，当您关闭自动绘制并自己绘制应用程序表面时，您可能会发现精灵的alpha组件和表面本身存在某些问题。

source: It's in these cases that you can switch on backface culling, as this saves about half the amount of drawing time, although it means you have the task of defining your polygons in the correct way to prevent issues.
zh_cn: 在这些情况下，你可以打开背面剔除，因为这节省了大约一半的绘制时间，尽管这意味着你有任务定义你的多边形以正确的方式防止问题。

source: JSON (JavaScript Object Notation) is a lightweight data-interchange format which is easy for to read and write, for both people and machines.
zh_cn: JSON (JavaScript对象表示法)是一种轻量级的数据交换格式，对人和机器来说都易于读写。

source: Just as it says, round() takes a real number and rounds it up or down to the nearest integer.
zh_cn: 正如其所言，round()取一个实数，向上或向下舍入到最接近的整数。

source: Keep in mind that for legacy support strings are indexed from 1, so 1 is the first position in the string, not 0 as you may expect.
zh_cn: 请记住，对于传统支持，字符串是从1开始索引的，因此1是字符串中的第一个位置，而不是您所期望的0。

source: Keep in mind that the instance sprite can have a blend colour and alpha setting (image_blend and image_alpha), as can the attachment (see the function skeleton_attachment_create_colour()), and so the final colour and alpha that the assigned attachment sprite for the slot will have will be a composite of all these values.
zh_cn: 请记住，实例精灵可以有一个混合颜色和alpha设置(image_blend和image_alpha)，附件也可以(参见函数rectangon_attachment_create_color())，因此分配给插槽的附件精灵的最终颜色和alpha将是所有这些值的组合。

source: Keep in mind when calculating the position to insert into that strings are indexed from 1, so the first character in a string is 1 and not 0 as you may expect.
zh_cn: 请记住，在计算要插入的位置时，字符串的索引是从1开始的，所以字符串中的第一个字符是1，而不是您所期望的0。

source: Keyboard/Keyboard Pressed/Keyboard Released
zh_cn: 键盘/键盘按下/键盘释放

source: Keys can be integers or strings, and if the given key does not exist then it will be created for you and set to the value.
zh_cn: 键可以是整数或字符串，如果给定的键不存在，则会为您创建并设置为该值。

source: Larger iPhone 6 with display 1920 x 1080
zh_cn: 更大的iPhone 6，屏幕1920 x 1080

source: Larger values are slower than lower ones.
zh_cn: 较大的值比较低的值慢。

source: Left button held down anywhere
zh_cn: 在任何地方按住左键

source: Left button held down on object
zh_cn: 在对象上按住左键

source: Left button just pressed anywhere
zh_cn: 在任何地方按下左键按钮

source: Left button just pressed on object
zh_cn: 在对象上按下左键

source: Left button just released anywhere
zh_cn: 在任何地方释放左键

source: Left button just released on object
zh_cn: 在对象上释放左键

source: Left shoulder button
zh_cn: 左肩按钮

source: Left shoulder trigger
zh_cn: 左肩触发

source: Left stick horizontal axis (analog)
zh_cn: 左斗杆水平轴(模拟)

source: Left stick vertical axis (analog)
zh_cn: 左斗杆垂直轴(模拟)

source: Like a revolute joint, the prismatic joint only has one degree of freedom, but with this joint it is directional relative to an axis rather than rotational and actually prevents any form of rotation.
zh_cn: 像转动关节一样，移动关节只有一个自由度，但这个关节相对于轴是有方向的，而不是旋转的，实际上阻止了任何形式的旋转。

source: Like in the function mp_potential_step() it uses potential field steps to accomplish this and the manner in which it does this can be modified through the function mp_potential_settings().
zh_cn: 与函数mp_potential_step()类似，它使用势场步长来完成此操作，其操作方式可通过函数mp_potential_settings()进行修改。

source: Long message for this exception.
zh_cn: 此异常的长消息。

source: Low-pass Filter
zh_cn: 低通滤波器

source: Lower priority sounds will be stopped in favour of higher priority sounds, and the priority value can be any real number (the actual value is arbitrary, and can be from 0 to 1 or 0 to 100, as GameMaker will prioritize them the same).
zh_cn: 低优先级的声音将被高优先级的声音所取代，并且优先级值可以是任何实数(实际值是任意的，可以从0到1或0到100，因为GameMaker会对它们进行相同的优先级排序)。

source: Luminosity values of light areas are added.
zh_cn: 添加亮区的亮度值。

source: Luminosity values of light areas are subtracted.
zh_cn: 减去亮区的亮度值。

source: Managed layers are not accessible to the user and used only for internal management when depth is used instead of layers.
zh_cn: 被管理层对用户是不可访问的，当使用深度而不是层时，它只用于内部管理。

source: Manual - The bounding box has been set manually to user defined values (either in the sprite editor, or using the function sprite_set_bbox())
zh_cn: 手动-边界框已被手动设置为用户定义的值(在sprite编辑器中，或使用函数sprite_set_bbox())

source: Max blending.
zh_cn: 最大混合。

source: Microsoft GDK platform (Xbox One and Series X/S)
zh_cn: 微软GDK平台 (Xbox One and Series X/S)

source: Microsoft Xbox One
zh_cn: 微软 Xbox One

source: Microsoft Xbox Series X/S
zh_cn: 微软 Xbox Series X/S

source: Middle button (or clickable wheel) held down anywhere
zh_cn: 在任何地方按住中键按钮(或可点击的滚轮)

source: Middle button (or clickable wheel) held down on object
zh_cn: 在对象上按住中键(或可点击的滚轮)

source: Middle button (or clickable wheel) just pressed anywhere
zh_cn: 在任何地方按下中键(或滚轮)

source: Middle button (or clickable wheel) just pressed on object
zh_cn: 在对象上按下中键(或滚轮)

source: Middle button just released anywhere
zh_cn: 中键在任何地方释放

source: Middle button just released on object
zh_cn: 在对象上释放中键

source: Mipmapping for all textures is enabled.
zh_cn: 所有纹理都启用了Mipmapping。

source: Mipmapping is disabled.
zh_cn: Mipmapping被禁用。

source: Mipmapping is enabled for textures that have it enabled in the Texture Group options (default).
zh_cn: 在纹理组选项(默认)中启用了Mipmapping。

source: Mono (single channel) audio.
zh_cn: Mono(单声道)音频。

source: More optional permissions
zh_cn: 更多可选的权限

source: Mouse event
zh_cn: 鼠标事件 Mouse event

source: Mouse just entered object's bounding box
zh_cn: 鼠标进入对象的边界框

source: Mouse just left object's bounding box
zh_cn: 鼠标离开对象的边界框

source: Mouse scroll direction down
zh_cn: 鼠标向下滚动方向

source: Mouse scroll direction up
zh_cn: 鼠标向上滚动方向

source: Mouse side button 1
zh_cn: 鼠标侧边键1

source: Mouse side button 2
zh_cn: 鼠标侧边键2

source: Mouse wheel scrolled downwards
zh_cn: 鼠标滚轮向下滚动

source: Mouse wheel scrolled upwards
zh_cn: 鼠标滚轮向上滚动

source: Mouse x-axis position in GUI coordinates
zh_cn: 鼠标在GUI坐标中的x轴位置

source: Mouse x-axis position in room coordinates
zh_cn: 鼠标x轴位置在房间坐标

source: Mouse y-axis position in GUI coordinates
zh_cn: 鼠标在GUI坐标中的y轴位置

source: Mouse y-axis position in room coordinates
zh_cn: 鼠标y轴位置在房间坐标

source: Mozilla Firefox
zh_cn: 谋智 火狐浏览器

source: Multiplayer session is closed automatically before event is fired
zh_cn: 多人游戏会话在事件被触发前自动关闭

source: Multiplies a number by itself and so returns the square of that number.
zh_cn: 将一个数乘以自身，得出该数的平方。

source: Must be a real number.
zh_cn: 必须是实数。

source: Must be a string.
zh_cn: 必须是字符串。

source: Must be an integer between 1 and 8.
zh_cn: 必须是1到8之间的整数。

source: Must be called after handling files opened using file_find_first() and file_find_next() functions to free memory.
zh_cn: 必须在处理使用file_find_first()和file_find_next()函数打开的文件以释放内存后调用。

source: NOTE: This event cannot be forced outside of a draw event and the constants and the constants are only for identifying the event when performed in these cases.
zh_cn: 意:此事件不能在draw事件之外强制执行，常量和常量仅用于在这些情况下执行时标识事件。

source: Name of a region to connect to
zh_cn: 要连接的区域的名称

source: Negative values will count from the end of the array.
zh_cn: 负值将从数组末尾开始计数。

source: Negative values will traverse the array in reverse order.
zh_cn: 负值将以相反的顺序遍历数组。

source: Negative=left, positive=right.
zh_cn: 负=左，正=右(Negative=left, positive=right.)

source: Negative=up, positive=down.
zh_cn: 负=上，正=下(Negative=up, positive=down.)

source: Neither path is deleted in the process and the result is two paths, with two different indexes, but the exact same form and points.
zh_cn: 在这个过程中没有删除任何一条路径，结果是两条路径，具有两个不同的索引，但是具有完全相同的形式和点。

source: Networking event
zh_cn: 网络活动

source: Newer iPad with Retina display size of 2048 x 1536
zh_cn: 新款iPad, Retina显示屏尺寸为2048 x 1536

source: Newer iPhone/iPod Touch with Retina display of 960 x 640
zh_cn: 新款iPhone/iPod Touch，视网膜显示屏960 x 640

source: Next you give the name of the skin to use (again, as set when the sprite was made), and a frame value.
zh_cn: 接下来，你要给出要使用的皮肤的名称(同样，与制作精灵时设置的一样)和帧值。

source: Next you need to define the calling convention to be used (see the constants list below) as well as the type of result to be expected (also a constant, as listed below).
zh_cn: 接下来，您需要定义要使用的调用约定(参见下面的常量列表)以及预期结果的类型(也是一个常量，如下所示)。

source: Nine Slicing is a technique used to scale rectangular images for preserving details, making them retain their original form after scaling.
zh_cn: 九宫格是一种用于缩放矩形图像以保留细节的技术，使它们在缩放后保持其原始形式。

source: Nintendo Switch
zh_cn: 任天堂 Switch

source: No buttons held down
zh_cn: 没有按住按键

source: No culling will be done
zh_cn: 不会进行剔除

source: No file filter
zh_cn: 无文件过滤器

source: No mouse button
zh_cn: 没有鼠标按钮

source: No updating means that particles created in this system will no longer change position, colour or any other parameter and that emitters will cease to work too, "freezing" the system at the exact point in which the automatic update was set to false.
zh_cn: 无更新意味着在此系统中创建的粒子将不再改变位置、颜色或任何其他参数，并且发射器也将停止工作，将系统"冻结"在自动更新设置为 false 的确切点。

source: Normal blending (the default blend mode).
zh_cn: 正常混合(默认混合模式)。

source: Normally all surfaces have depth buffers so if you draw 3D objects to them then it'll sort them properly by depth in order to maintain functional parity between rendering to surfaces and rendering to the back buffer, however allocating depth buffers essentially doubles the amount of memory required for surfaces, which could be an excessive and unnecessary overhead especially if your game is very memory intensive, and for 2D games they aren't generally required.
zh_cn: 通常情况下，所有的表面都有深度缓冲区，所以如果你绘制3D对象到它们，那么它将根据深度对它们进行适当的排序，以保持表面渲染和反向缓冲区渲染之间的功能一致性，然而分配深度缓冲区实际上会使表面所需的内存数量增加一倍，这可能是一种过度和不必要的开销，特别是如果你的游戏是非常内存密集型的，而对于2D游戏来说，它们通常不需要。

source: Normally all surfaces have depth buffers so if you draw 3D objects to them then it'll sort them properly by depth, however allocating depth buffers essentially doubles the size of surfaces, which could be an excessive and unnecessary overhead especially if your game is very memory intensive or predominantly 2D.
zh_cn: 通常情况下，所有的表面都有深度缓冲，所以如果你绘制3D对象，那么它就会根据深度对它们进行适当的排序，然而分配深度缓冲实际上会使表面的大小增加一倍，这可能是一种过度和不必要的开销，特别是当你的游戏是非常内存密集或主要是2D的时候。

source: Normally both sides are drawn, but if you make a closed shape (like a pyramid) then this is a waste of processing power because the back side of the triangle can never be seen.
zh_cn: 通常情况下两边都是画出来的，但如果你制作的是一个封闭的形状(如金字塔)，那么这就是一种处理能力的浪费，因为三角形的背面永远看不到。

source: Normally for a physics simulation to work, it must be continuous and cannot be stopped and started, or have instances suddenly moved from one place to another in the room.
zh_cn: 通常情况下，物理模拟必须是连续的，不能停止和启动，也不能让实例突然从房间的一个地方移动到另一个地方。

source: Normally texture widths and heights lie in the range 0 - 1, but if you specify a value larger than 1 by default the rest is not drawn (the entire texture will be drawn with an "empty" section corresponding to the percentage over 1 that is used.
zh_cn: 通常纹理的宽度和高度在0 - 1的范围内，但是如果你指定了一个大于1的缺省值，其余的部分就不会被绘制(整个纹理将被绘制成一个"空的"部分，对应于所使用的大于1的百分比。

source: Normally the mass, center of mass, and inertia for an instance is calculated using a combination the surface area of the bound fixtures and their density.
zh_cn: 通常情况下，实例的质量、质心和惯性是通过结合使用绑定夹具的表面积及其密度来计算的。

source: Normally this will happen automatically when one of the two instances is destroyed, or when the room ends, but there are times when you may wish to do this manually.
zh_cn: 通常情况下，当两个实例中的一个被破坏时，或者当房间结束时，这将自动发生，但有时您可能希望手动执行此操作。

source: Normally you will use a damping value between 0 and 1, but you can use any non-negative value if required.
zh_cn: 通常情况下，您将使用0到1之间的阻尼值，但如果需要，您也可以使用任何非负值。

source: Normally you would assign these attachments in your animation program (Spine), but with this function you can create your own at run-time using a sprite asset from your game.
zh_cn: 通常，您可以在动画程序(Spine)中指定这些附件，但是通过此函数，您可以在运行时使用游戏中的精灵资源创建自己的附件。

source: Normally you would assign these attachments in your animation program (Spine), but with this function you can create/replace your own at run-time using a sprite asset from your game.
zh_cn: 通常情况下，您可以在动画程序(Spine)中指定这些附件，但是通过此函数，您可以在运行时使用游戏中的精灵资源创建/替换您自己的附件。

source: Normally you would set this when you start the path using path_start() but you may wish to change this behaviour depending on any number of events in your game.
zh_cn: 通常你会在使用path_start()启动路径时设置这个，但是你可能希望根据游戏中的事件数量来改变这个行为。

source: Normally you would use the function part_system_create_layer() instead of this one.
zh_cn: 通常您会使用函数part_system_create_layer()而不是此函数。

source: Normally, in each step the position in the time line is increased by 1, however you can change this amount by setting this variable to a different value.
zh_cn: 通常情况下，在每一步中，时间线中的位置增加1，但是您可以通过将该变量设置为不同的值来更改此量。

source: Normally, when an instance has a parent object, it automatically inherits all the same events as the parent, but if (for example) your parent object has a create event and you add one to your child object, all instances of the child object will run the new create event that you have added and not that which is in the parent object.
zh_cn: 通常，当一个实例有一个父对象时，它会自动继承所有与父对象相同的事件，但是如果(例如)你的父对象有一个create事件，而你将一个create事件添加到子对象中，那么子对象的所有实例都会运行你添加的新create事件，而不是父对象中的那个事件。

source: Not only can you apply force and gravity to an object with the physics in GameMaker but you can also apply an impulse.
zh_cn: 你不仅可以用GameMaker中的物理原理对物体施加力和重力，还可以施加脉冲。

source: Not used currently.
zh_cn: 目前未使用。

source: Note that AA is enabled by default, but you can change the AA state for added fonts using the function font_add_enable_aa(), as long as it is called before adding the font.
zh_cn: 注意，AA在默认情况下是启用的，但是您可以使用函数font_add_enable_aa()来更改已添加字体的AA状态，只要在添加字体之前调用此函数即可。

source: Note that GameMaker does not automatically append the .gif file extension, so you should include this as part of the filename string if you wish the saved file to be identified as a GIF.
zh_cn: 注意，GameMaker不会自动添加.gif文件扩展名，因此如果您希望保存的文件被识别为gif文件，您应该将它作为文件名字符串的一部分。

source: Note that activation is not instantaneous, and an instance that has been activated in this way will not be considered to be active until the end of the event in which the function was called.
zh_cn: 注意，激活不是瞬时的，以这种方式激活的实例在调用函数的事件结束之前不会被认为是活动的。

source: Note that after you no longer need the sound you should call the function audio_destroy_stream() with the sound index to remove it from memory otherwise you may get a memory leak which will slow down and eventually crash your game.
zh_cn: 注意，当你不再需要声音时，你应该调用函数audio_destroy_stream()和声音索引将其从内存中删除，否则你可能会出现内存泄漏，从而减慢速度并最终崩溃你的游戏。

source: Note that angles are returned in degrees, and 0º is to the right, 90º is up, 180º is to the left and 270º is down.
zh_cn: 注意，角度是以度为单位返回的，0º为右，90º为上，180º为左，270º为下。

source: Note that any audio currently being played when this function is called will be stopped.
zh_cn: 注意，调用此函数时，当前正在播放的任何音频都将被停止。

source: Note that any white space placed at the start of the string will be stripped out before being parsed for drawing because of this.
zh_cn: 注意，由于这个原因，在解析绘图之前，放在字符串开头的任何空白都将被删除。

source: Note that as the value to be written can be a real number, all decimals will be written with a "." point as separator.
zh_cn: 注意，由于要写入的值可以是实数，因此所有小数都将使用"。"作为分隔符。

source: Note that attached sprites are referenced through their name string as assigned in Spine, or when you called skeleton_attachment_create().
zh_cn: 注意，附加的子画面是通过在Spine中指定的名称字符串引用的，或者是在调用skeleton_attachment_create()时引用的。

source: Note that before you can delete the buffer itself, you must first free all sound ID's associated with it.
zh_cn: 注意，在删除缓冲区本身之前，必须首先释放与它相关的所有声音ID。

source: Note that by default the function is synchronous, meaning that your game may appear to "hang" as the connection is made.
zh_cn: 注意，默认情况下，此函数是同步的，这意味着您的游戏可能会出现"挂起"的连接。

source: Note that calling this function on a room asset created in the Asset Browser will permanently clear the room of instances, and even calling game_restart() will not return the room to it's original state (only ending the game and opening it again will start with the room in its original state again).
zh_cn: 注意，在资源浏览器中创建的房间资源上调用此函数将永久清除房间的实例，即使调用game_restart()也不会将房间返回到其原始状态(只有结束游戏并再次打开它，房间才会再次以其原始状态开始)。

source: Note that clearing a list will de-reference any data structures stored in it giving a memory leak, so you would need to go through the list and destroy all data structure items manually before clearing it to prevent this.
zh_cn: 注意，清除列表将会取消对存储在列表中的任何数据结构的引用，从而导致内存泄漏，因此您需要检查列表，并在清除列表之前手动销毁所有数据结构项，以防止这种情况。

source: Note that clearing a map will de-reference any data structures stored in the map giving a memory leak, so you would need to go through it and destroy all data structure items manually before clearing the map to prevent this.
zh_cn: 注意，清除map将去引用存储在映射中的任何数据结构，从而导致内存泄漏，因此在清除映射之前，您需要遍历它并手动销毁所有数据结构项，以防止这种情况发生。

source: Note that deactivation is not instantaneous, and an instance that has been deactivated in this way will not be considered to be inactive until the end of the event in which the function was called.
zh_cn: 注意，停用不是即时的，以这种方式停用的实例，直到调用此函数的事件结束前，不会被视为非活动的，。

source: Note that depth is defined as being higher the "further away" from the camera and lower the "closer" to the camera, so if you have three layers with depths -100, 0, 100, the layers will draw in the order 100, 0, -100, so that the "top" layer (ie, the closest to the camera view and so drawn over everything else) will be the layer with the -100 depth.
zh_cn: 注意，深度被定义为越"远离"相机越高，越"接近"相机越低，所以如果你有三个深度为- 100,0,100的图层，这些图层将按照100,0，-100的顺序绘制，因此"顶部"图层(即，最靠近相机视图的图层，因此被绘制在其他所有图层之上)将是深度为-100的图层。

source: Note that destroying a list will de-reference any data structures stored in it giving a memory leak, so you would need to go through the list and destroy all data structure items manually before destroying it to prevent this.
zh_cn: 注意，销毁列表将取消对存储在列表中的任何数据结构的引用，从而导致内存泄漏，因此您需要检查列表，并在销毁列表之前手动销毁所有数据结构项，以防止这种情况。

source: Note that destroying a map will de-reference any data structures stored in the map giving a memory leak, so you would need to go through the map and destroy all data structure items manually before destroying it to prevent this.
zh_cn: 注意，销毁map将撤销对存储在map中的任何数据结构的引用，从而导致内存泄漏，因此在销毁map之前，您需要遍历map并手动销毁所有数据结构项，以防止发生这种情况。

source: Note that directions in GameMaker are usually calculated as 0° being right, 90° being up, 180° being left and 270° being down, and that the gravity and gravity_direction variables can modify the direction value when they are used in your games.
zh_cn: 注意，GameMaker中的方向通常计算为0°为右，90°为上，180°为左，270°为下，重力和gravity_direction变量可以在游戏中使用时修改方向值。

source: Note that directions in GameMaker are usually calculated as 0° being right, 90° being up, 180° being left and 270° being down.
zh_cn: 注意，GameMaker中的方向通常以0°为右，90°为上，180°为左，270°为下来计算。

source: Note that each room is permanently added to the game until the executable is closed, ie: rooms added through code cannot be deleted again.
zh_cn: 注意，每个房间都是永久添加到游戏中，直到可执行程序关闭，即:通过代码添加的房间不能再次删除。

source: Note that even if you have a view port set to visible, if view ports are not enabled (using the built-in variable view_enabled or enabling them in the Room Editor) then they will not be drawn to the screen.
zh_cn: 注意，即使您将视口设置为可见，如果视口未启用(使用内置变量view_enabled或在房间编辑器中启用它们)，则它们不会被绘制到屏幕上。

source: Note that floats can also be used but the upper value after the point will be excluded, so irandom(9.7) will return a value from 0 to 9 only.
zh_cn: 注意，也可以使用浮点数，但是点后面的上限值将被排除，所以irandom(9.7)将只返回一个从0到9的值。

source: Note that gravity is a cumulative force and will accelerate the object if you choose not to cap the final speed, and it's usual that you'd set this variable to small decimal values like 0.01.
zh_cn: 注意，重力是一个累积力，如果你选择不限制最终速度，它会加速物体，通常你会将这个变量设置为小数，如0.01。

source: Note that if either of the objects have no sprite or no mask defined, the results will be incorrect.
zh_cn: 注意，如果任何一个对象没有定义精灵或遮罩，结果将是不正确的。

source: Note that if one of the texture pages is used elsewhere in the room (by another instance sprite or a background, etc...) you may get a minor performance hit as the page is immediately reloaded back into memory again, so care should be taken when using this function.
zh_cn: 注意，如果一个纹理页面在房间的其他地方被使用(通过另一个实例精灵或背景，等等...)您可能会受到轻微的性能影响，因为页面会立即重新加载到内存中，所以使用此函数时应该小心。

source: Note that if only one of the two colliding particles is a colour-mixing one, the other particle retains its pre-collision colour.
zh_cn: 注意，如果两个碰撞粒子中只有一个是混色粒子，则另一个粒子会保留其碰撞前的颜色。

source: Note that if the DS map being loaded was saved with an array as one of the key values, this array will have been converted into a DS list on load.
zh_cn: 注意，如果正在加载的DS map保存时使用数组作为键值之一，则该数组将在加载时转换为DS列表。

source: Note that if the DS map being saved contains an array, this array will be converted into a DS list instead when saved.
zh_cn: 注意，如果保存的DS map包含一个数组，则该数组在保存时将转换为DS列表。
